# 5. Exploratory Data Analysis (EDA)

In [1]:
import pandas as pd
import sqlite3
import prettytable
from pathlib import Path

import helpers as hlp


%load_ext sql

## Setup

In [2]:
pd.set_option("display.max_columns", None)
pd.set_option("display.max_colwidth", None)

INPUT_FILE = hlp.DATA_DIR / Path("spacex.csv")
DB_FILE = hlp.DATA_DIR / Path("05_spacex_data.sqlite3")

prettytable.DEFAULT = "DEFAULT"

## Open database

In [3]:
con = sqlite3.connect(DB_FILE)
cur = con.cursor()

## Save data to sqlite database

In [4]:
df = pd.read_csv(INPUT_FILE, encoding="utf-8", header=0, index_col=False)
df.to_sql("SPACEXTBL", con, if_exists="replace", index=False, method="multi")

101

## Connect to database

In [5]:
%sql sqlite:///data/05_spacex_data.sqlite3

## Run queries

In [6]:
# MISC. Get the name of all columns
%sql PRAGMA table_info(SPACEXTBL);

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[(0, 'Date', 'TEXT', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'INTEGER', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing_Outcome', 'TEXT', 0, None, 0)]

In [7]:
# Unique launch sites
%sql SELECT DISTINCT Launch_Site AS site FROM SPACEXTBL;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [8]:
%%sql 
--# Launch sites that begin with CCA
SELECT Date, Booster_Version, Launch_Site, Orbit, Customer, Mission_Outcome, Landing_Outcome 
    FROM SPACEXTBL 
    WHERE Launch_Site LIKE 'CCA%' 
    LIMIT 5;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('2010-06-04', 'F9 v1.0  B0003', 'CCAFS LC-40', 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', 'F9 v1.0  B0004', 'CCAFS LC-40', 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', 'F9 v1.0  B0005', 'CCAFS LC-40', 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', 'F9 v1.0  B0006', 'CCAFS LC-40', 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', 'F9 v1.0  B0007', 'CCAFS LC-40', 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [9]:
# Unique boosters
%sql SELECT DISTINCT Customer AS customer FROM SPACEXTBL WHERE customer LIKE 'NASA (CRS)%';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('NASA (CRS)',), ('NASA (CRS), Kacific 1',)]

In [10]:
%sql SELECT DISTINCT Customer FROM SPACEXTBL;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('SpaceX',),
 ('NASA (COTS) NRO',),
 ('NASA (COTS)',),
 ('NASA (CRS)',),
 ('MDA',),
 ('SES',),
 ('Thaicom',),
 ('Orbcomm',),
 ('AsiaSat',),
 ('U.S. Air Force NASA NOAA',),
 ('ABS Eutelsat',),
 ('Turkmenistan National Space Agency',),
 ('NASA (LSP) NOAA CNES',),
 ('SKY Perfect JSAT Group',),
 ('Iridium Communications',),
 ('EchoStar',),
 ('NRO',),
 ('Inmarsat',),
 ('Bulsatcom',),
 ('Intelsat',),
 ('NSPO',),
 ('U.S. Air Force',),
 ('SES EchoStar',),
 ('KT Corporation',),
 ('Northrop Grumman',),
 ('Hisdesat exactEarth SpaceX',),
 ('Hispasat  NovaWurks',),
 ('NASA (LSP)',),
 ('Thales-Alenia/BTRC',),
 ('Iridium Communications GFZ ‚ NASA',),
 ('Telesat',),
 ('Telkom Indonesia',),
 ('CONAE',),
 ('Es hailSat',),
 ('Spaceflight Industries',),
 ('USAF',),
 ('PSN, SpaceIL / IAI',),
 ('NASA (CCD) ',),
 ('Canadian Space Agency (CSA)',),
 ('Spacecom',),
 ('NASA (CRS), Kacific 1',),
 ('Sky Perfect JSAT, Kacific 1',),
 ('NASA (CTS)',),
 ('NASA (CCDev)',),
 ('SpaceX, Planet Labs',),
 ('U.S. Space Force',),
 ('Republic of Korea Army, Spaceflight Industries (BlackSky)',),
 ('SpaceX, Spaceflight Industries (BlackSky), Planet Labs',),
 ('SpaceX, Planet Labs, PlanetIQ',),
 ('CONAE, PlanetIQ, SpaceX',),
 ('USSF',),
 ('NASA (CCP)',),
 ('NASA / NOAA / ESA / EUMETSAT',)]

In [11]:
%%sql 
--# Payload mass carried by boosters launched by NASA (CRS)
SELECT sum(PAYLOAD_MASS__KG_) AS nasa_payload_mass 
    FROM SPACEXTBL 
    WHERE customer LIKE 'NASA (CRS)%';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[(48213,)]

In [12]:
%sql SELECT DISTINCT Booster_Version FROM SPACEXTBL WHERE Booster_Version LIKE 'F9 v1.1%';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('F9 v1.1  B1003',),
 ('F9 v1.1',),
 ('F9 v1.1 B1011',),
 ('F9 v1.1 B1010',),
 ('F9 v1.1 B1012',),
 ('F9 v1.1 B1013',),
 ('F9 v1.1 B1014',),
 ('F9 v1.1 B1015',),
 ('F9 v1.1 B1016',),
 ('F9 v1.1 B1018',),
 ('F9 v1.1 B1017',)]

In [13]:
%%sql 
--# Average payload mass carried by booster version F9 v1.1
SELECT round(avg(PAYLOAD_MASS__KG_), 2) AS avg_f9_payload_mass 
    FROM SPACEXTBL 
    WHERE Booster_Version LIKE 'F9 v1.1%';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[(2534.67,)]

In [14]:
%sql SELECT DISTINCT Landing_outcome FROM SPACEXTBL;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]

In [15]:
%%sql 
--# first successful landing on a ground pad
SELECT min(Date) AS first_successful_landing 
    FROM SPACEXTBL 
    WHERE Landing_Outcome = 'Success (ground pad)';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('2015-12-22',)]

In [16]:
%%sql
--# boosters successfully landed in dron ship and payload mass between 4000 and 6000
SELECT DISTINCT Booster_Version FROM SPACEXTBL
    WHERE 4000 < PAYLOAD_MASS__KG_ < 6000
    AND Landing_Outcome = 'Success (drone ship)';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('F9 FT B1021.1',),
 ('F9 FT B1022',),
 ('F9 FT B1023.1',),
 ('F9 FT B1026',),
 ('F9 FT B1029.1',),
 ('F9 FT  B1021.2',),
 ('F9 FT  B1029.2',),
 ('F9 FT B1036.1',),
 ('F9 FT B1038.1',),
 ('F9 B4 B1041.1',),
 ('F9 FT  B1031.2',),
 ('F9 B4 B1042.1',),
 ('F9 B4 B1045.1',),
 ('F9 B5  B1046.1',)]

In [17]:
%sql SELECT DISTINCT Mission_Outcome FROM SPACEXTBL;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('Success',),
 ('Failure (in flight)',),
 ('Success (payload status unclear)',),
 ('Success ',)]

In [18]:
%%sql
SELECT COUNT(Mission_Outcome) FROM SPACEXTBL
    WHERE Mission_Outcome = 'Success'
    OR Mission_Outcome LIKE 'Failure%';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[(99,)]

In [19]:
%%sql
-- # total number of successful and unsuccessful mission outcomes
SELECT DISTINCT Mission_Outcome AS outcome, count(Mission_Outcome) AS count
    FROM SPACEXTBL
    GROUP BY Mission_Outcome;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

In [20]:
%%sql 
-- # boosters that have carried the maximum payload mass
SELECT Booster_Version FROM SPACEXTBL
    WHERE PAYLOAD_MASS__KG_ = (SELECT max(PAYLOAD_MASS__KG_) 
    FROM SPACEXTBL);

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [21]:
%%sql
SELECT Date 
FROM SPACEXTBL
WHERE year(Date)='2015'
LIMIT 5

 * sqlite:///data/05_spacex_data.sqlite3
(sqlite3.OperationalError) no such function: year
[SQL: SELECT Date
FROM SPACEXTBL
WHERE year(Date)='2015'
LIMIT 5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [22]:
%%sql
-- #List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015
SELECT substr(Date, 0, 5) AS year, 
Booster_Version AS booster, 
Launch_Site AS launch_site, 
Landing_Outcome AS outcome
    FROM SPACEXTBL 
    WHERE year = '2015' AND outcome = 'Failure (drone ship)';

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('2015', 'F9 v1.1 B1012', 'CCAFS LC-40', 'Failure (drone ship)'),
 ('2015', 'F9 v1.1 B1015', 'CCAFS LC-40', 'Failure (drone ship)')]

In [23]:
%%sql
-- # month_names, failure landing_outcomes in drone ship, boosters, and launch_site for the months in year 2015
SELECT substr(date, 6, 2) As month, Booster_Version, Launch_Site FROM SPACEXTBL
WHERE Landing_Outcome LIKE '%Failure (drone ship)%'
AND CAST(substr(date, 0, 5) AS INTEGER) == 2015;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('01', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [24]:
%%sql
--# count of landing outcomes between 2010-06-04 and 2017-03-20 in descending order
SELECT Landing_Outcome AS outcome, COUNT(Landing_Outcome) AS outcome_count FROM SPACEXTBL
GROUP BY outcome
ORDER BY outcome_count DESC;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('Success', 38),
 ('No attempt', 21),
 ('Success (drone ship)', 14),
 ('Success (ground pad)', 9),
 ('Failure (drone ship)', 5),
 ('Controlled (ocean)', 5),
 ('Failure', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1),
 ('No attempt ', 1)]

In [25]:
%%sql
--# count of landing outcomes between 2010-06-04 and 2017-03-20 in descending order
SELECT Landing_Outcome AS outcome, COUNT(Landing_Outcome) AS outcome_count 
    FROM SPACEXTBL
    WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
    GROUP BY outcome
    ORDER BY outcome_count DESC;

 * sqlite:///data/05_spacex_data.sqlite3
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

In [26]:
df.columns

Index(['Date', 'Time (UTC)', 'Booster_Version', 'Launch_Site', 'Payload',
       'PAYLOAD_MASS__KG_', 'Orbit', 'Customer', 'Mission_Outcome',
       'Landing_Outcome'],
      dtype='object')

In [27]:
cur.close()
con.close()